VERB_EXC_2_CONJUGATION = ["гнать", "дышать", "держать", "слышать", "смотреть", "вертеть", "видеть", "зависеть",
                          "ненавидеть", "обидеть", "терпеть"]
VERB_EXC_1_CONJUGATION = ["брить", "зиждить", "стелить"]
VERB_EXC_2_CONJUGATION_REF = ["гнаться", "дышаться", "держаться", "слышаться", "смотреться", "вертеться", "видеться",
                              "обидеться"]
VERB_EXC_1_CONJUGATION_REF = ["бриться", "зиждиться", "стелиться"]

# This corpus contains 113 word types tagged as particles (PART)
PARTICLES = ['ага', 'итак', 'ладненько', 'не-а', 'неужто', 'ну-с', 'ну-у', 'пущай', 'увы', 'что', 'а', 'абы', 'аж',
             'аль', 'ар', 'б', 'бен', 'бишь', 'будто', 'бы', 'было', 'ван', 'ведь', 'вишь', 'вон', 'вот', 'все',
             'все-таки', 'всего', 'всего-то', 'вс', 'вс', '-таки', 'да', 'даже', 'де', 'делла', 'дель', 'дескать',
             'ди', 'душ', 'едва', 'единственно', 'ей-богу', 'еле', 'еле-еле', 'еще', 'ещ', 'ж', 'же', 'зато', 'и',
             'ибн', 'именно', 'ишь', 'ка', 'как', 'кое', 'ла', 'ладно', 'ли', 'лишь', 'ль', 'минус', 'мол', 'нате',
             'не', 'невесть', 'нет', 'нет-нет', 'неужели', 'нешто', 'ни', 'ни-ни', 'ничего', 'нон', 'ну', "о'кей",
             'ох', 'плюс', 'попало',  'попросту', 'почти', 'просто', 'просто-напросто', 'просто-таки', 'прям', 'прямо',
             'прямо-таки', 'пускай', 'пусть', 'разве', 'себе', 'словно', 'так', 'также', 'таки', 'там', 'то', 'того',
             'тоже', 'только', 'только-только', 'точно', 'уж', 'уже', 'фон', 'хотя', 'черт-те', 'чуть', 'чуть-чуть',
             'эвон', 'эль', 'это', 'не']
# This corpus contains 35 lemmas tagged as pronouns (PRON)
PRONOUNS = ['все', 'вся', 'вс', 'вы', 'кое-кто', 'который', 'кто', 'кто-либо', 'кто-нибудь', 'кто-то', 'многие', 'мы',
            'некого', 'некто', 'немногие', 'нечего', 'нечто', 'никто', 'ничто', 'он', 'она', 'они', 'оно', 'прочее',
            'себя', 'тем', 'то', 'ты', 'чем', 'что', 'что-либо', 'что-нибудь', 'что-то', 'это', 'я', "его", "их", "они",
            "ее", "этом", "этой", "мне", "то", "которые", "тем", "того", "том", "них", "нас"]
# This corpus contains 40 lemmas tagged as determiners (DET) [from UD documentation] + from most frequent words
DETERMINERS = ['ваш', 'весь', 'все', 'всякий', 'другой', 'его', 'ее', 'иной', 'их', 'каждый', 'каков', 'какой',
               'какой-либо', 'какой-нибудь', 'какой-то', 'кое-какой', 'кой', 'любой', 'многий', 'мой', 'наш', 'наша',
               'некий', 'некоторый', 'немногий', 'никакой', 'никой', 'один', 'полпути', 'прочий', 'сам', 'самый',
               'свой', 'сей', 'такой', 'твой', 'тем', 'тот', 'чей', 'этот']
# from most frequent words
ADPOSITIONS = ["в", "на", "с", "по", "к", "из", "для", "от", "о", "за", "у", "до", "при", "во", "через", "между", "об",
               "обо", "под", "со", "без", "из-за", "перед", "возле", "мимо", "около", "про", "насчет", "вроде", "ввиду",
               "вопреки"]
# from most frequent words
CONJUNCTIONS = ["и", "а", "но", "что", "как", "если", "чтобы", "когда", "или"]

VOICELESS = ["к", "х", "ч", "ж"]
VOICED = ['н', 'в', 'м', 'т', 'л', 'р', 'с', 'д', 'з', 'п', 'б']